Repository: yamato/perl6doc-jp
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: Many operators work on a particular type of data.
ja: 多くの演算子はデータの特定の型で機能します。

source: Many subroutines cannot meaningfully work with arbitrary parameters, but require that the parameters support certain methods or have other properties.
ja: 多くのサブルーチンは不定のパラメータでは意味のある動作ができず、特定のメソッドをサポートするか他のプロパティを持つパラメータを必要とします。

source: Match objects
ja: マッチオブジェクト

source: Matching a string against that regex searches for that string:
ja: その正規表現と文字列をマッチングすることは、その文字列を捜します：

source: Meaning
ja: 意味

source: Method/function
ja: メソッド／関数

source: Methods
ja: メソッド

source: Methods on Arrays
ja: 配列のメソッド

source: Modifiers
ja: 修飾子

source: More abstractly, any declarations associated with those textual blocks are also considered to be part of the lexical scope, and this is where the term earns the "lexical" part of its name, in the sense that lexical scoping actually does define the "lexicon" for the current chunk of code, insofar as the definitions of variables and routines create a local domain-specific language.
ja: より抽象的には、それらのテキストブロックに関連付けられた宣言は全てレキシカルスコープの一部とみなされ、そしてこれは名前のレキシカル部分を得る場所でもある。という訳で、変数とルーチンの定義が局所的なドメイン固有言語を創造する限りにおいて、レキシカルスコープは現在のコードのチャンクのための辞書を実際に定義する。

source: More interestingly, the where {!defined $d} clause is a constraint, which defines a so-called subset type.
ja: より面白いことに、where {!defined $d}という節はサブセット型と呼ばれる制約です。

source: More precisely, it first scans outward (lexically) for the innermost containing when block.
ja: より正確には、それは最初にwhenブロックを含む最も深い部分を外側へ（レキシカルに）スキャンする。

source: More precisely, it's a promise that the object or objects contained in the variable are capable of responding to the methods of the indicated "role".
ja: より正確には、オブジェクトまたは変数に含まれるオブジェクトが指示された“ロール”のメソッドに反応することができるという約束です。

source: More specifically, when you write:
ja: より明白には、あなたが次のように書くとき：

source: Most list contexts are flat rather than sliced, so the boundaries between individual take calls usually disappear.
ja: 最も多いリストコンテキストはスライスよりもフラットなので、個々のtake呼び出しの間の境界は普通は見えなくなる。

source: Most mathematical functions are available both as methods and functions, so you can write both (-5).abs and abs(-5).
ja: 大部分の数学関数はメソッドと関数として使えるので、あなたは(-5).absとabs(-5)の両方を書くことができます。

source: Most modern regular expression facilities are more powerful than traditional regular expressions due to the influence of languages such as Perl, but the short-hand term regex has stuck and continues to mean "regular expression-like pattern matching".
ja: 多くのモダンな正規表現機能は、Perlのような言語の影響により従来の正規表現より強力です。しかし速記用語regexは定着して、「正規表現のようなパターンマッチ」を意味し続けています。

source: Most of the non-value-producing phasers may also be so used:
ja: 大部分の値を出さないphasersも使うことができる：

source: Most properties are only interesting after successful matches.
ja: 大部分のプロパティは、成功したマッチの後だけで興味深いです。

source: Much like return may only return from an "official" subroutine or method, a loop exit like next should be caught by the construct the user expects it to be caught by.
ja: とても似ているreturnは「公式な」サブルーチンかメソッドからだけ戻れる。nextのようなループの脱出はユーザーがキャッチされると期待する構造にキャッチされるべきだ。

source: Multi methods with the same name from different roles will not conflict with each other.
ja: 異なるロールからの同じ名前によるマルチメソッドは、互いに競合しないでしょう。

source: Multi-methods and composition
ja: マルチメソッドと合成

source: Multiline Comments
ja: 複数行コメント

source: Multiple Inheritance
ja: 多重継承

source: Multiple MAIN subs
ja: マルチMAINサブ

source: Multiple arguments
ja: 複数の引数

source: Multiple inheritance and mixin mechanisms rarely provide this degree of conflict resolution.
ja: 多重継承とミックスインメカニズムは、この程度の競合解消をめったに提供しません。

source: Multiple parameters may be passed, in which case the list is traversed more than one element at a time:
ja: 複数のパラメータが渡されるようなら、その場合はリストは一度に一つ以上の要素を横断される：

source: Name
ja: 名前

source: Name Equivalence of Types
ja: 型の名前同一性

source: Named Arguments and Parameters
ja: 名前付き引数とパラメータ

source: Named arguments are actually Pairs (of keys and values).
ja: 名前付き引数は実際はPair（のキーと値）です。

source: Named arguments can be provided with the --name=value syntax common to many GNU tools, and positional arguments just by their value.
ja: 名前付き引数は多くのGNUツールと共通の--name=value構文で提供されることができます。そして位置引数は丁度それらの値です。

source: Named regex that match within the grammar may be accessed via the Match object similar to a hash where the keys are the regex names and the values are the Match object that represents that part of the overall regex match.
ja: グラマー内でマッチする名前付き正規表現はMatchオブジェクトとしてアクセスされ、それはキーが正規表現の名前、値が正規表現の全体のマッチ部分を表すMatchオブジェクトであるハッシュに似ています。

source: Named regexes
ja: 名前付き正規表現

source: Named regexes make it easy to organize complex regexes by building them up from smaller pieces.
ja: 名前をつけられた正規表現は、より小さな部分からそれらを構築することによって複雑な正規表現を編成することを容易にします。

source: Names
ja: 名前

source: Names and Variables
ja: 名前と変数

source: Names may also be declared in the signature of a function.
ja: 名前は関数のシグネチャーでも宣言されます。

source: Narrowness
ja: 狭さ

source: Nearly all Perl 6 built-in functions and operators export a proto definition, which prevents accidental overriding of built-ins (footnote: One of the very rare exceptions is the smart match operator infix:<~~> which is not easily overloadable.
ja: ほとんど全てのPerl 6組み込み関数と演算子はプロト定義をエクスポートします。そして、それは組み込みを偶然に越えることを防ぎます（注釈：非常に珍しい例外の1つは、スマートマッチ演算子接中辞infix:<~~>で、簡単にはオーバーロードできません。

source: Nested Signatures in Multi-dispatch
ja: マルチディスパッチのネストしたシグネチャー

source: Next comes a simple numeric addition, 1 + ....
ja: 次は単純な数値の加算、1 + ...が来ます。

source: Next comes an optional name and an optional signature.
ja: 次はオプションの名前とオプションのシグネチャーが来ます。

source: Next comes the expression @scores».key».chars.
ja: 次に式@scores».key».charsが来ます。

source: Next comes the expression @scoresｻ.keyｻ.chars.
ja: 次に式@scores».key».charsが来ます。

source: Next, the regex captures a word ((\w+)), followed by at least one non-word character \W+.
ja: 次に、正規表現はワードをキャプチャーし（(\w+)）、少なくともひとつの非ワード文字\W+が続きます。

source: No additional context is applied by the take operator, since all context is lazy in Perl 6.
ja: take演算子によって追加のコンテキストが何も適用されないので、Perl 6では全てのコンテキストはレイジーだ。

source: No temporization is necessary with the explicit form since $_ is a formal parameter to the block.
ja: $_をブロックの仮パラメータにしてから明白な形式でテンポラリー化は必要ない。

source: Normal flat list context ignores parcel boundaries and flattens the list.
ja: 通常のフラットリストコンテキストはパーセルの境界を無視し、リストを平坦化する。

source: Normal names and variables are declared using a scope declarator:
ja: 通常の名前と変数はスコープ宣言で宣言されます：

source: Normal objects just use their location as their identity, but if a class wishes to behave as a value type, it can define a .WHICH method that makes different objects look like the same object if they happen to have the same contents.
ja: 通常のオブジェクトはそれらの識別としてロケーションを使うだけですが、もしクラスが値型として振る舞いたいのであれば、同じ内容を持っている場合に異なるオブジェクトを同じように見せる.WHICHメソッドを定義することができます。

source: Note also that Perl 5's special rule causing
ja: 次のことにも注意。Perl 5の特別な規則で

source: Note however that
ja: ただし注意

source: Note that $x is also initialized to the Int type object.
ja: $xはInt型オブジェクトにも初期化されるので注意してください。

source: Note that any die in the catch lambda eventually rethrows outside the lambda as a new exception, but not until the current exception handler has a chance to handle all exceptions that came in via @!.
ja: catch lambdaのどれかひとつのdieがlambdaを新しい例外として結局外側に再スローする。しかし現在の例外ハンドラが@!を経て入るすべての例外をハンドルする機会を持つまでではない。

source: Note that any construct in the statement_prefix category defines special syntax.
ja: statement_prefixカテゴリーのどんな構成物も特別な文法を定義するので注意。

source: Note that in each piece of lifted code there are references to variables defined in the multi, such as $a, $b, and &f.
ja: リフトされたコードのそれぞれの断片はマルチに定義された変数を参照する。$a、 $b、&fのような。

source: Note that it's impolite to die if a Task has started but not yet finished, because this time it might be due to parallelism rather than cycles:
ja: Taskが開始したがまだ終わらなかったなら、dieするのは無作法なので注意してください。なぜなら循環よりも並列の期限が来ているかもしれないからです。

source: Note that temporizations that are undone upon scope exit must be prepared to be redone if a continuation within that scope is taken.
ja: スコープの終了でなされないテンポライゼーションは、そのスコープ内の継続が取られるならやり直すために準備されなければならないことに注意しろ。

source: Note that the take itself is in sink context in this example because the for loop is in the sink context provided inside the gather.
ja: take自体はこの例ではsinkコンテキストにある。なぜならgather内に与えられたforループがsinkコンテキストにあるからだ。

source: Note that the value being evaluated for truth and subsequently bound is not necessarily a value of type Bool.
ja: 真偽のために評価される、そしてその後に続いてバインドされる値はBool型である必要性はない。

source: Note that this is not like declaring a public attribute, as some languages allow; you really get both a private storage location and a method, without having to write the method by hand.
ja: これはいくつかの言語が許すようなパブリックな属性を宣言するものではないので注意してください；あなたは手でメソッドを書くことなく、本当に両方のプライベートな記録場所とメソッドを得ます。

source: Note that using the . twigil has created a method that will provide with readonly access to the attribute.
ja: . twigilを使うと属性への読み取り専用アクセスのメソッドを作るので注意してください。

source: Note the use of rx/ ... / rather than m/ ... / to construct the regex.
ja: 正規表現を構築するためにrx/ ... /よりもm/ ... /の使用に注意してください。

source: Note the use of » and [||] to write succinctly what would otherwise have involved looping over all the dependencies of the Task:
ja: 一方のTaskの全ての従属物がループに巻き込まれることを完結に書くために»と[||]の使用に注意してください：

source: Note though that the contents of parens or brackets is parsed as a semicolon-separated list of statements, so you can say:
ja: 丸括弧かブラケットの内容はセミコロンで分けられた文のリストとしてパースされる。だからあなたはこう書ける：

source: Note, however, that
ja: 注意、けれども、その

source: Nothing is ever bound implicitly, however, and many conditionals would simply bind True or False in an uninteresting fashion.
ja: これまでに何も暗黙にバインドされていない、どんな方法でも、そして多数の条件文が単純にTrueかFalseをつまらないやり方でバインドする。

source: Notice how the custom constructor and sensible use of whitespace allows a layout which makes task dependencies clear.
ja: カスタムコンストラクタと気の利いた空白の使い方がタスクの依存を明白にレイアウトしていることに気づいてください。

source: Notice the little smiley face attached to the parameter's type: :D.
ja: 小さなニコニコした顔がパラメータの型に付いていることに気づいてください：:D

source: Now all the methods made available by both the Programmer class and the Cook class are available from the GeekCook class.
ja: 現在、ProgrammerクラスとCookクラスによって利用可能となるすべてのメソッドは、GeekCookクラスから入手可能です。

source: Now all the necessary informations are in place, and the chart can print:
ja: 現在、すべての必要な情報は使える状態です。そしてチャートは以下を出力することができます：

source: Now any object of type Programmer can make use of the methods and accessors defined in the Employee class as though they were from the Programmer class.
ja: Programmer型のオブジェクトならなんでも、Employeeクラスのメソッドとアクセサが使えます。それらがProgrammerクラスであったかのように。

source: Numbers
ja: 数

source: Numbers in scientific notation such as 6.022e23 are of type Num.
ja: 6.022e23のような科学的記数法の数はNum型です。

source: Numbers in the form a + bi, where bi is the imaginary component, are of type Complex.
ja: a + biという形式（biは虚数成分です）の数は、Complex型です。

source: Numeric Comparisons
ja: 数値の比較

source: Numeric and boolean context of hashes
ja: ハッシュの数値とブールコンテキスト

source: Numeric and string conversions use these lazy warnings to allow (but not require) failsoft semantics.
ja: 数値と文字列の変換はフェールソフトセマンティクスを許可する（しかし要求されない）ためにlazy warningsを使う。

source: Object Oriented Programming provides the concept of inheritance as one of the mechanisms to allow for code reuse.
ja: オブジェクト指向プログラミングは、コードの再利用を可能にするメカニズムの1つとして継承の概念を提供します。

source: Of course, an explicit next might be clearer than a succeed if you really want to go directly to the next iteration.
ja: 当然、明示的なnextはsucceedよりもはっきりしているかもしれない。もしあなたが本当に次の反復に直接行きたいと思うなら。

source: Of course, classes can override methods and attributes defined on ancestoral classes by defining their own.
ja: もちろん、クラスはそれ自身のメソッドと属性を定義することで祖先のクラスのものをオーバーライドできます。

source: Often it is useful to limit the match to the start or end of a string or line or to word boundaries.
ja: マッチを文字列または行の始まりまたは終わりまで、または単語境界に制限することはしばしば役立ちます。

source: On the other hand '2' eqv 2 returns False, because one argument is a string, the other an integer and so they are not of the same type.
ja: 一方で'2' eqv 2はFalseを返します。なぜなら一方の引数は文字列、もう一方は整数なので、それらは同じ型ではありません。

source: On the other hand, succeed can take an optional argument giving the value for that iteration of the loop.
ja: 一方では、succeedはループの反復のための変数を与える任意の引数をとることができる。

source: On the other hand, if a statement_prefix is followed by a non-block statement, all nested blockless statement_prefixes will terminate at the same statement ending:
ja: 一方では、もしstatement_prefixの後にブロックでない文が続くなら、全ての入れ子になったブロックなしのstatement_prefixesは同じ文の末端で終わるだろう：

source: Once the final atom matches, the regex engine attempts to match the goal (B).
ja: 最終的なアトムが1回マッチすると、正規表現エンジンは最終目的（B）にマッチしようと試みます。

source: Once you have the Match object, what can you do with it?
ja: あなたがMatchオブジェクトを持っていたら、それをどうすることができますか？

source: One additional level of control is the notion of lazy warnings.
ja: 制御の追加のレベルはlazy warningsの考えだ。

source: One can specify a separator with % after the quantifier:
ja: 数量詞の後の%でセパレーターを指定できます。

source: One candidate remains from the JSON example:
ja: 1つの候補はJSONの例から残ります：

source: One of the Perl5-isms that Perl 6 eliminates is the need to verify the "definedness" of a subroutine's arguments.
ja: Perl 5の慣習の一つでPerl 6が取り除くものは、サブルーチンの引数が定義されているか確かめる必要です。

source: One other difference from Perl 5 is that the default is not to undefine a variable.
ja: 一つPerl 5と違うことは、デフォルトは変数を未定義にしないことだ。

source: One vertical bar between multiple parts of a regex means that the alternatives are tried in parallel and the longest matching alternative wins.
ja: 複数の正規表現のパーツの間の垂直バーは、選択肢が並列に試され、そして最も長い選択肢が勝つことを意味します。

source: One-or-failure is very useful when dealing with per-object role application.
ja: One-or-failureはオブジェクトごとにロールを適用して対処する場合に非常に有用です。

source: One-pass parsing
ja: ワンパス構文解析

source: Only Failure objects need to store the actual status however; other types just return True.)
ja: Failureだけが実際のステータスを格納することを必要とする；他の型はただTrueを返す。）

source: Only argumentless phasers may use the statement form.
ja: 引数なしのphasersだけが文形式を使う。

source: Only names defined in the lexical scope of the immediately surrounding routine are considered concrete.
ja: すぐ近くでルーチンを囲んでいるレキシカルスコープに定義された名前だけが具体的だと見なされる。

source: Only word characters, digits, and the underscore cause an exact substring search.
ja: ワード文字、数字とアンダーラインだけが、正確な部分文字列検索を引き起こします。

source: Operator
ja: 演算子

source: Operators
ja: 演算子

source: Operators are very short names for often used routines.
ja: 演算子は、しばしば使われるルーチンの非常に短い名前です。

source: Optional Parameters
ja: 任意のパラメータ

source: Or one could constrain arguments to those that exist as keys of a hash:
ja: またはハッシュのキーとしてこれらが存在する引数の制約も可能です：

source: Order of Parameters
ja: パラメータの順番

source: Other Regex Features
ja: 他の正規表現機能

source: Other kinds of phasers can be installed as well; these are automatically called at various times as appropriate, and some of them respond to various control exceptions and exit values.
ja: 他の種類のphasersは同様にうまくインストールされる；それらは適切に様々なタイミングで自動的に呼ばれ、それらのいくつかは様々な制御例外と抜け出る値に応答する。

source: Other operators compare strings lexicographically.
ja: 他の演算子は文字列を辞書編集上で比較します。

source: Other programming languages call that a hash table, dictionary, or map.
ja: 他のプログラミング言語ではそれをハッシュテーブル、ディクショナリー、またはマップと呼びます。

source: Other similar forms, where a keyword is followed by code to be controlled by it, may also take bare statements, including try, once, quietly, contend, async, lazy, and sink.
ja: 他の似ている形式で、コードが続くキーワードがそれによって制御され、裸の文をとることができる。try、once、quietly、contend、async、lazy、sinkを含む。

source: Otherwise the value will be the null string.
ja: さもなければ値はnull文字列になる。

source: Otherwise, if the class has a method of the same name that is not declared as a multi, then the method in the class alone--as usual--will take precedence.
ja: 一方、クラスがマルチと宣言されていない同じ名前のメソッドを持っているならば、クラスのメソッドだけが優位をとるでしょう ― 通常通りに。

source: Otherwise, the method performs all of the task's dependencies, using the for construct to iterate over all of the items in the @!dependencies attribute.
ja: 一方、メソッドは全ての仕事の依存を実行します。for構造を使ってすべての@!dependencies属性のアイテムを繰り返し実行します。

source: Our goal is to convey the "flavor" of writing Perl 6 programs so that the reader may proceed to write their own native Perl 6 programs rather than programs that resemble some other language (footnote: Some programmers can still write Fortran in any language, however :)).
ja: 我々のゴールは、読者が他の言語に似ているプログラムよりもネイティブのPerl 6プログラムを書き始めることができるようにPerl 6プログラムを記述する「特色」を伝えることです。（しかし、一部のプログラマーはまだFortranをどんな言語でも書くことができます＾＾）

source: Overriding Inherited Methods
ja: 継承したメソッドのオーバーライド

source: Parameter types
ja: パラメーターの型

source: Parameters can also have multiple names.
ja: パラメータは複数の名前を持つこともできます。

source: Parameters may be given types, just like any other variable:
ja: パラメータは他の変数のように型を与えられることができます：

source: Parcels
ja: パーセル

source: Passing Arrays, Hashes and Code
ja: 配列、ハッシュ、コードを渡す

source: Passing a numeric value of type Real instead invokes the second.
ja: 数値のReal型を代わりに渡すと2番目を起動します。

source: Passing two Rocks means that ::T, T is one step narrower than Any, Any.
ja: 2つのRockを渡すことは、::T, TはAny, Anyよりも1ステップ狭いということを意味します。

source: Pattern matching
ja: パターンマッチ

source: Pattern matching is the process of applying these patterns to actual text to look for matches.
ja: パターンマッチは、マッチを探すためにこれらのパターンを実際のテキストに適用するプロセスです。

source: Perl 5 developers try to extend the language in various ways while keeping backwards compatibility with past versions of Perl.
ja: Perlの過去のバージョンとの下位互換性を維持しながら、Perl 5開発者はさまざまな方法で言語を拡張しようとします。

source: Perl 5 will interpret it as:
ja: Perl 5はそれをこのように解釈するでしょう：

source: Perl 5's "local" function has been renamed to temp to better reflect what it does.
ja: Perl 5のlocal関数は何をするのかより良く表すようにtempに名前を変更した。

source: Perl 6 allows you to do so by applying roles to individual objects at runtime.
ja: Perl 6は、実行時にロールを個々のオブジェクトに適用することによってそれを可能にします。

source: Perl 6 classes retain the responsibility for modeling and managing instances.
ja: Perl 6のクラスは、インスタンスをモデル化して管理することに対する責任を保持します。

source: Perl 6 developers extend the language by adding new syntactic and semantic features that enable more power and expressiveness without the restriction of backward compatibility with Perl 5 or earlier versions.
ja: Perl 6開発者は、Perl 5または以前の版との下位互換性の制限なしでより多くのパワーと表現の豊かさを可能にする新しい構文法で意味論的な機能を加えることによって、言語を拡張します。

source: Perl 6 has Failure objects, known as "unthrown exceptions" (though really a Failure merely contains an unthrown exception), which know whether they have been handled or not.
ja: Perl 6はFailureオブジェクト、「スローされない例外」を持つ（実際はFailureは単にスローされない例外を含む）。それはそれらがハンドルされたかどうか知っている。

source: Perl 6 has a rich set of literal forms, many of which can be used for textual input as well.
ja: Perl 6はリテラルの形式の豊富なセットを持っており、それらの多くが原文の入力に同様に使うことができます。

source: Perl 6 has an optional type system that helps you write safer code that performs better.
ja: Perl 6はより良く動作する安全なコードを書くのに役立つ任意指定の型システムを持っています。

source: Perl 6 has several numeric types which can intermix freely--such as subtracting a floating point value from an integer, as 123 - 12.1e1.
ja: Perl 6は自由に混在させることができるいくつかの数値型を持っています ― 123 - 12.1e1として、整数から浮動小数点値を減算するなどです。

source: Perl 6 implementations
ja: Perl 6の実装

source: Perl 6 includes a system of sigils to mark the fundamental structural type of a variable:
ja: Perl 6は変数の基本的な構造上の型を表示するためにシギルシステムを含みます：

source: Perl 6 intrinsically supports big integers and rationals through its system of type declarations.
ja: Perl 6は型宣言のシステムによって大きい整数と有理数をサポートします。

source: Perl 6 is a language specification for which multiple compilers and interpreters exist in various stages of completeness.
ja: Perl 6は多くコンパイラとインタープリタが網羅性の様々な過程に存在する言語仕様です。

source: Perl 6 is a specification.
ja: Perl 6は仕様です。

source: Perl 6 is even better.
ja: Perl 6はより強力です。

source: Perl 6 is rather more liberal than many languages in the area of constructors.
ja: Perl 6は、コンストラクタにおいては多くの言語より自由がききます。

source: Perl 6 is the newest member of the family of languages known as Perl.
ja: Perl 6はPerlとして知られている言語ファミリーで最も新しいメンバーです。

source: Perl 6 is versatile, intuitive, and flexible.
ja: Perl 6は多目的で、直観的で、柔軟です。

source: Perl 6 provides another alternative: action methods.
ja: Perl 6は別の選択肢を提供します：アクションメソッドです。

source: Perl 6 provides another operator that allows you to perform comparisons that Do The Right Thing with ~~, the smart match operator.
ja: Perl 6は~~によって正しいものをうまく比較するスマートマッチ演算子を用意しています。

source: Perl 6 regexes allow this through the use of the :sigspace modifier (shortened to :s):
ja: Perl 6の正規表現は、:sigspace修飾子（:sと省略できる）を用いることにより、これを可能にします：

source: Perl 6 subroutines are objects.
ja: Perl 6のサブルーチンはオブジェクトです。

source: Perl 6 supports the ability for one class to inherit from one or more classes.
ja: Perl 6は、1つのクラスが1またはそれ以上のクラスから継承する機能をサポートします。

source: Perl 6 supports the notion of properties on various kinds of objects.
ja: Perl 6は様々なオブジェクトでプロパティの概念をサポートします。

source: Perl 6's precedence rules allow you to express many common operations naturally, without thinking about precedence at all.
ja: Perl 6の優先順位規則は、優先順位について考えることなく、自然に多くの一般の演算子を表すことができます。

source: Perl 6's precedence rules state that the infix => operator binds its arguments more tightly than the infix , operator, which in turn binds more tightly than the = assignment operator.
ja: Perl 6の優先順位規則は接中辞=>演算子が接中辞,演算子よりタイトにその引数を結びつけると宣言します。そしてそれは=割り当て演算子よりタイトに次々に結合します。

source: Perl 6, like many other languages, uses the class keyword to introduce a new class.
ja: Perl 6は多くの他の言語のように、新しいクラスを導入するためにclassキーワードを使用します。

source: Perl can also examine the contents of the arguments provided to decide which of several variants of a function--each with the same name--to call.
ja: Perlは関数 ― 同じ名前による各々 ― のいくつかの変形のどれを呼ぶべきかについて決めるために提供される引数の内容を調べることもできます。

source: Perl is philosophy (there's more than one way to do it; easy things should be easy, and hard things possible); Perl is custom (comprehensive testing, idioms); Perl is architectural edifice (the Comprehensive Perl Archive Network); and Perl is community (perl5-porters, perl6-language).
ja: Perlは哲学です（複数のやり方があります。簡単なことは簡単で、難しいことは可能にすべきです）。Perlは慣習です（総合的なテスト、イディオム）。Perlは構造的な構成物です（Comprehensive Perl Archive Network）。そしてPerlはコミュニティです（perl5-porters、perl6-language）。

source: Perl originated as a programming language intended to gather and summarize information from text files.
ja: Perlはテキストファイルから情報を集めて要約する目的のプログラミング言語として始まりました。

source: Perl supports generic types through what are called "roles" which represent capabilities or interfaces.
ja: Perlは機能またはインターフェースを表す“ロール”と呼ばれるものを通してジェネリック型をサポートします。

source: Perl takes the attributes and methods defined in each role and copies them into the class.
ja: Perlは個々のロールで定義されている属性とメソッドをクラスにコピーします。

source: Perl types with both positional and named parts also show up in various other situations.
ja: 位置と名前付きの両方のPerlの型はいろいろな状況で現れます。

source: Perl usually decides which function to call based on the name of the function or the contents of a function reference.
ja: Perlは通常、関数の名前か関数リファレンスの内容に基づいてどの関数を呼ぶべきかについて決めます。

source: Perl variables have two associated types: their "of type" and their "container type".
ja: Perlの変数は2つの関連する型を持ちます：それらの“型”とそれらの“コンテナ”です。

source: Phasers marked with a * can be used for their return value.
ja: *でマークされたPhasersはそれらの返り値として使用できる。

source: Pointy blocks and bare closures are transparent to return, in that the return statement still means &?ROUTINE.leave from the Routine that existed in dynamic scope when the closure was cloned.
ja: ポインティブロックと裸のクロージャはreturnには明白だ。return文はまだ クロージャが複製された時ダイナミックスコープに抜け出たRoutineから&?ROUTINE.leaveすることを意味する。

source: Positional parameters are always required by default.
ja: デフォルトでは順序に依存するパラメータは常に必要になります。

source: Preface
ja: 序文

source: Presumably multiple dispatch could sort this out.]
ja: 多分、マルチディスパッチはこれを選り分けできる。]

source: Programming language designers often call these first-class subroutines; they are as fundamental to the language as hashes or arrays are.
ja: プログラミング言語の設計者はしばしばそれらをファーストクラスサブルーチンと呼びます：それらはハッシュや配列のように言語の基本となります。
